;******************************************************************************
;* TMS320C6x C/C++ Codegen                                       Unix v6.0.21 *
;* Date/Time created: Tue Apr 12 22:18:54 2011                                *
;******************************************************************************
	.compiler_opts --c64p_l1d_workaround=default --disable:=sploop --endian=little --hll_source=on --mem_model:code=far --mem_model:data=far --predefine_memory_model_macros --quiet --silicon_version=6500 --symdebug:dwarf 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C64x+                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed 1st, size 2nd                                  *
;*                       Based on options: -o3, -ms0                          *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far                                                  *
;*   Pipelining        : Enabled                                              *
;*   Speculate Loads   : Enabled with threshold = 129                         *

	.dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$162, DW_AT_byte_size(0x08)
$C$DW$386	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$386, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$162

$C$DW$T$165	.dwtag  DW_TAG_typedef, DW_AT_name("MSGQ_Queue")
	.dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
$C$DW$T$175	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$165)
	.dwattr $C$DW$T$175, DW_AT_address_class(0x20)
$C$DW$T$133	.dwtag  DW_TAG_typedef, DW_AT_name("MEM_sizep")
	.dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
$C$DW$T$197	.dwtag  DW_TAG_typedef, DW_AT_name("LgUns")
	.dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
$C$DW$T$295	.dwtag  DW_TAG_typedef, DW_AT_name("U32_IQ")
	.dwattr $C$DW$T$295, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$295, DW_AT_language(DW_LANG_C)
$C$DW$T$298	.dwtag  DW_TAG_typedef, DW_AT_name("Uword32")
	.dwattr $C$DW$T$298, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$298, DW_AT_language(DW_LANG_C)
$C$DW$T$362	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$362, DW_AT_type(*$C$DW$T$11)
$C$DW$T$363	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$362)
	.dwattr $C$DW$T$363, DW_AT_address_class(0x20)

$C$DW$T$364	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*$C$DW$T$363)
	.dwattr $C$DW$T$364, DW_AT_language(DW_LANG_C)
$C$DW$387	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*$C$DW$T$208)
	.dwendtag $C$DW$T$364


$C$DW$T$366	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$366, DW_AT_language(DW_LANG_C)
$C$DW$388	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*$C$DW$T$17)
	.dwendtag $C$DW$T$366


$C$DW$T$367	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$367, DW_AT_language(DW_LANG_C)
$C$DW$389	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*$C$DW$T$11)
$C$DW$390	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*$C$DW$T$11)
	.dwendtag $C$DW$T$367

$C$DW$T$368	.dwtag  DW_TAG_typedef, DW_AT_name("LgBits")
	.dwattr $C$DW$T$368, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$368, DW_AT_language(DW_LANG_C)
$C$DW$T$12	.dwtag  DW_TAG_base_type, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x08)
	.dwattr $C$DW$T$12, DW_AT_bit_size(0x28)
	.dwattr $C$DW$T$12, DW_AT_bit_offset(0x18)
$C$DW$T$369	.dwtag  DW_TAG_typedef, DW_AT_name("Long")
	.dwattr $C$DW$T$369, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$369, DW_AT_language(DW_LANG_C)
$C$DW$T$370	.dwtag  DW_TAG_typedef, DW_AT_name("Word40")
	.dwattr $C$DW$T$370, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$370, DW_AT_language(DW_LANG_C)
$C$DW$T$13	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x08)
	.dwattr $C$DW$T$13, DW_AT_bit_size(0x28)
	.dwattr $C$DW$T$13, DW_AT_bit_offset(0x18)
$C$DW$T$371	.dwtag  DW_TAG_typedef, DW_AT_name("Uword40")
	.dwattr $C$DW$T$371, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$371, DW_AT_language(DW_LANG_C)
$C$DW$T$14	.dwtag  DW_TAG_base_type, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
$C$DW$T$372	.dwtag  DW_TAG_typedef, DW_AT_name("I64_IQ")
	.dwattr $C$DW$T$372, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$T$372, DW_AT_language(DW_LANG_C)
$C$DW$T$373	.dwtag  DW_TAG_typedef, DW_AT_name("Word64")
	.dwattr $C$DW$T$373, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$T$373, DW_AT_language(DW_LANG_C)
$C$DW$T$15	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
$C$DW$T$374	.dwtag  DW_TAG_typedef, DW_AT_name("U64_IQ")
	.dwattr $C$DW$T$374, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$374, DW_AT_language(DW_LANG_C)
$C$DW$T$375	.dwtag  DW_TAG_typedef, DW_AT_name("Uword64")
	.dwattr $C$DW$T$375, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$375, DW_AT_language(DW_LANG_C)
$C$DW$T$16	.dwtag  DW_TAG_base_type, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
$C$DW$T$376	.dwtag  DW_TAG_typedef, DW_AT_name("Float")
	.dwattr $C$DW$T$376, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$376, DW_AT_language(DW_LANG_C)
$C$DW$T$377	.dwtag  DW_TAG_typedef, DW_AT_name("Fword32")
	.dwattr $C$DW$T$377, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$377, DW_AT_language(DW_LANG_C)
$C$DW$T$17	.dwtag  DW_TAG_base_type, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
$C$DW$T$378	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$T$378, DW_AT_address_class(0x20)

$C$DW$T$379	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*$C$DW$T$378)
	.dwattr $C$DW$T$379, DW_AT_language(DW_LANG_C)
$C$DW$391	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*$C$DW$T$3)
	.dwendtag $C$DW$T$379


$C$DW$T$380	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$T$380, DW_AT_language(DW_LANG_C)
$C$DW$392	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*$C$DW$T$11)
$C$DW$393	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*$C$DW$T$11)
	.dwendtag $C$DW$T$380

$C$DW$T$381	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$381, DW_AT_type(*$C$DW$T$17)
$C$DW$T$382	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$381)
	.dwattr $C$DW$T$382, DW_AT_address_class(0x20)

$C$DW$T$383	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*$C$DW$T$382)
	.dwattr $C$DW$T$383, DW_AT_language(DW_LANG_C)
$C$DW$394	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*$C$DW$T$208)
	.dwendtag $C$DW$T$383

$C$DW$T$18	.dwtag  DW_TAG_base_type, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x08)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("QUE_Elem")
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
$C$DW$395	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$395, DW_AT_name("next")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("_next")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$396	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$396, DW_AT_name("prev")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("_prev")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$20

$C$DW$T$19	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$19, DW_AT_address_class(0x20)
$C$DW$T$63	.dwtag  DW_TAG_typedef, DW_AT_name("QUE_Handle")
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
$C$DW$T$21	.dwtag  DW_TAG_typedef, DW_AT_name("QUE_Obj")
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
$C$DW$T$70	.dwtag  DW_TAG_typedef, DW_AT_name("QUE_Elem")
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)

$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_name("KNL_Job")
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x10)
$C$DW$397	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$397, DW_AT_name("wListElem")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("_wListElem")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$398	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$398, DW_AT_name("wCount")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("_wCount")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$399	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$399, DW_AT_name("fxn")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("_fxn")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$28

$C$DW$T$23	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$23, DW_AT_address_class(0x20)
$C$DW$T$24	.dwtag  DW_TAG_typedef, DW_AT_name("KNL_JobHandle")
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
$C$DW$T$29	.dwtag  DW_TAG_typedef, DW_AT_name("KNL_Job")
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
$C$DW$T$30	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr $C$DW$T$30, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
$C$DW$T$31	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_address_class(0x20)
$C$DW$T$32	.dwtag  DW_TAG_typedef, DW_AT_name("String")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
$C$DW$T$384	.dwtag  DW_TAG_typedef, DW_AT_name("va_list")
	.dwattr $C$DW$T$384, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$384, DW_AT_language(DW_LANG_C)
$C$DW$T$84	.dwtag  DW_TAG_typedef, DW_AT_name("Char")
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
$C$DW$T$85	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$T$85, DW_AT_address_class(0x20)

$C$DW$T$86	.dwtag  DW_TAG_array_type, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$86, DW_AT_byte_size(0x190)
$C$DW$400	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$400, DW_AT_upper_bound(0x63)
	.dwendtag $C$DW$T$86

$C$DW$T$385	.dwtag  DW_TAG_typedef, DW_AT_name("Int8")
	.dwattr $C$DW$T$385, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$385, DW_AT_language(DW_LANG_C)
$C$DW$T$386	.dwtag  DW_TAG_typedef, DW_AT_name("SmInt")
	.dwattr $C$DW$T$386, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$386, DW_AT_language(DW_LANG_C)

$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_name("SEM_Obj")
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x20)
$C$DW$401	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$401, DW_AT_name("job")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("_job")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$402	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$402, DW_AT_name("count")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("_count")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$403	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$403, DW_AT_name("pendQ")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("_pendQ")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$404	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$404, DW_AT_name("name")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("_name")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$33

$C$DW$T$52	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$52, DW_AT_address_class(0x20)
$C$DW$T$53	.dwtag  DW_TAG_typedef, DW_AT_name("SEM_Handle")
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
$C$DW$T$387	.dwtag  DW_TAG_typedef, DW_AT_name("SEM_Obj")
	.dwattr $C$DW$T$387, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$387, DW_AT_language(DW_LANG_C)

$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_name("DEV_Fxns")
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x1c)
$C$DW$405	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$405, DW_AT_name("close")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("_close")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$406	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$406, DW_AT_name("ctrl")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("_ctrl")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$407	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$407, DW_AT_name("idle")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("_idle")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$408	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$408, DW_AT_name("issue")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("_issue")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$409	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$409, DW_AT_name("open")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("_open")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$410	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$410, DW_AT_name("ready")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("_ready")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$411	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$411, DW_AT_name("reclaim")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("_reclaim")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$58

$C$DW$T$66	.dwtag  DW_TAG_typedef, DW_AT_name("DEV_Fxns")
	.dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
$C$DW$T$75	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$75, DW_AT_address_class(0x20)

$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_name("DEV_Callback")
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x0c)
$C$DW$412	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$412, DW_AT_name("fxn")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("_fxn")
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$413	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$413, DW_AT_name("arg0")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("_arg0")
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$414	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$414, DW_AT_name("arg1")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("_arg1")
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$62

$C$DW$T$67	.dwtag  DW_TAG_typedef, DW_AT_name("DEV_Callback")
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
$C$DW$T$68	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$68, DW_AT_address_class(0x20)
$C$DW$T$77	.dwtag  DW_TAG_typedef, DW_AT_name("SIO_Callback")
	.dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
$C$DW$T$78	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$T$78, DW_AT_address_class(0x20)

$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_name("DEV_Obj")
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x4c)
$C$DW$415	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$415, DW_AT_name("todevice")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("_todevice")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$416	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$416, DW_AT_name("fromdevice")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("_fromdevice")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$417	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$417, DW_AT_name("bufsize")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("_bufsize")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$418	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$418, DW_AT_name("nbufs")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("_nbufs")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$419	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$419, DW_AT_name("segid")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("_segid")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$420	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$420, DW_AT_name("mode")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("_mode")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$421	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$421, DW_AT_name("devid")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("_devid")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$422	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$422, DW_AT_name("params")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("_params")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$423	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$423, DW_AT_name("object")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("_object")
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$424	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$424, DW_AT_name("fxns")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("_fxns")
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$425	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$425, DW_AT_name("timeout")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("_timeout")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$426	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$426, DW_AT_name("align")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("_align")
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$427	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$427, DW_AT_name("callback")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("_callback")
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$69

$C$DW$T$34	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$34, DW_AT_address_class(0x20)
$C$DW$T$35	.dwtag  DW_TAG_typedef, DW_AT_name("DEV_Handle")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
$C$DW$T$72	.dwtag  DW_TAG_typedef, DW_AT_name("DEV_Obj")
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)

$C$DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$71, DW_AT_name("DEV_Frame")
	.dwattr $C$DW$T$71, DW_AT_byte_size(0x20)
$C$DW$428	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$428, DW_AT_name("link")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("_link")
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$429	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$429, DW_AT_name("addr")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("_addr")
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$430	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$430, DW_AT_name("size")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("_size")
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$431	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$431, DW_AT_name("misc")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("_misc")
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$432	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$432, DW_AT_name("arg")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("_arg")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$433	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$433, DW_AT_name("cmd")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("_cmd")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$434	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$434, DW_AT_name("status")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("_status")
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$71

$C$DW$T$73	.dwtag  DW_TAG_typedef, DW_AT_name("DEV_Frame")
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
$C$DW$T$74	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$T$74, DW_AT_address_class(0x20)

$C$DW$T$76	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$76, DW_AT_name("SIO_Obj")
	.dwattr $C$DW$T$76, DW_AT_byte_size(0x64)
$C$DW$435	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$435, DW_AT_name("dobj")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("_dobj")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$436	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$436, DW_AT_name("flush")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("_flush")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$437	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$437, DW_AT_name("framelist")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("_framelist")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$438	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$438, DW_AT_name("standardFrame")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("_standardFrame")
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$439	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$439, DW_AT_name("model")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("_model")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$440	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$440, DW_AT_name("pfxns")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("_pfxns")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$76

$C$DW$T$80	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$80, DW_AT_address_class(0x20)
$C$DW$T$81	.dwtag  DW_TAG_typedef, DW_AT_name("SIO_Handle")
	.dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)

$C$DW$T$390	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$T$390, DW_AT_language(DW_LANG_C)
$C$DW$441	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*$C$DW$T$32)
$C$DW$442	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*$C$DW$T$22)
$C$DW$443	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*$C$DW$T$64)
$C$DW$444	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*$C$DW$T$389)
	.dwendtag $C$DW$T$390

$C$DW$T$393	.dwtag  DW_TAG_typedef, DW_AT_name("SIO_Obj")
	.dwattr $C$DW$T$393, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$393, DW_AT_language(DW_LANG_C)

$C$DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$79, DW_AT_name("SIO_Attrs")
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x1c)
$C$DW$445	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$445, DW_AT_name("nbufs")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("_nbufs")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$446	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$446, DW_AT_name("segid")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("_segid")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$447	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$447, DW_AT_name("align")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("_align")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$448	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$448, DW_AT_name("flush")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("_flush")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$449	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$449, DW_AT_name("model")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("_model")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$450	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$450, DW_AT_name("timeout")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("_timeout")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$451	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$451, DW_AT_name("callback")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("_callback")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$79

$C$DW$T$388	.dwtag  DW_TAG_typedef, DW_AT_name("SIO_Attrs")
	.dwattr $C$DW$T$388, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$388, DW_AT_language(DW_LANG_C)
$C$DW$T$389	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$388)
	.dwattr $C$DW$T$389, DW_AT_address_class(0x20)

$C$DW$T$87	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$87, DW_AT_name("TSKLOOP_TransferInfo_tag")
	.dwattr $C$DW$T$87, DW_AT_byte_size(0x1a4)
$C$DW$452	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$452, DW_AT_name("inputStream")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("_inputStream")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$453	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$453, DW_AT_name("outputStream")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("_outputStream")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$454	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$454, DW_AT_name("numTransfers")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("_numTransfers")
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$455	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$455, DW_AT_name("bufferSize")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("_bufferSize")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$456	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$456, DW_AT_name("receivedSize")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("_receivedSize")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$457	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$457, DW_AT_name("numBuffers")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("_numBuffers")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$458	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$458, DW_AT_name("buffers")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("_buffers")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$87

$C$DW$T$290	.dwtag  DW_TAG_typedef, DW_AT_name("TSKLOOP_TransferInfo")
	.dwattr $C$DW$T$290, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$290, DW_AT_language(DW_LANG_C)
$C$DW$T$291	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$290)
	.dwattr $C$DW$T$291, DW_AT_address_class(0x20)
$C$DW$T$292	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$291)
	.dwattr $C$DW$T$292, DW_AT_address_class(0x20)
$C$DW$T$395	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$395, DW_AT_type(*$C$DW$T$292)
$C$DW$T$396	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$396, DW_AT_type(*$C$DW$T$291)

$C$DW$T$101	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$101, DW_AT_name("POOL_Fxns")
	.dwattr $C$DW$T$101, DW_AT_byte_size(0x10)
$C$DW$459	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$459, DW_AT_name("open")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("_open")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$460	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$460, DW_AT_name("close")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("_close")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$461	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$461, DW_AT_name("alloc")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("_alloc")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$462	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$462, DW_AT_name("free")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("_free")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$101

$C$DW$T$105	.dwtag  DW_TAG_typedef, DW_AT_name("POOL_Fxns")
	.dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
$C$DW$T$106	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$T$106, DW_AT_address_class(0x20)

$C$DW$T$107	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$107, DW_AT_name("POOL_Obj")
	.dwattr $C$DW$T$107, DW_AT_byte_size(0x10)
$C$DW$463	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$463, DW_AT_name("initFxn")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_initFxn")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$464	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$464, DW_AT_name("fxns")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("_fxns")
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$465	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$465, DW_AT_name("params")
	.dwattr $C$DW$465, DW_AT_TI_symbol_name("_params")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$466	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$466, DW_AT_name("object")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("_object")
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$107

$C$DW$T$108	.dwtag  DW_TAG_typedef, DW_AT_name("POOL_Obj")
	.dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
$C$DW$T$109	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$T$109, DW_AT_address_class(0x20)
$C$DW$T$402	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$T$402, DW_AT_address_class(0x20)
$C$DW$T$403	.dwtag  DW_TAG_typedef, DW_AT_name("POOL_Handle")
	.dwattr $C$DW$T$403, DW_AT_type(*$C$DW$T$402)
	.dwattr $C$DW$T$403, DW_AT_language(DW_LANG_C)

$C$DW$T$110	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$110, DW_AT_name("POOL_Config")
	.dwattr $C$DW$T$110, DW_AT_byte_size(0x08)
$C$DW$467	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$467, DW_AT_name("allocators")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("_allocators")
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$468	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$468, DW_AT_name("numAllocators")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("_numAllocators")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$110

$C$DW$T$404	.dwtag  DW_TAG_typedef, DW_AT_name("POOL_Config")
	.dwattr $C$DW$T$404, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$T$404, DW_AT_language(DW_LANG_C)
$C$DW$T$405	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$404)
	.dwattr $C$DW$T$405, DW_AT_address_class(0x20)

$C$DW$T$111	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$111, DW_AT_name("LOG_Event")
	.dwattr $C$DW$T$111, DW_AT_byte_size(0x10)
$C$DW$469	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$469, DW_AT_name("seqnum")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("_seqnum")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$470	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$470, DW_AT_name("val1")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("_val1")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$471	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$471, DW_AT_name("val2")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("_val2")
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$472	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$472, DW_AT_name("val3")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("_val3")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$111

$C$DW$T$113	.dwtag  DW_TAG_typedef, DW_AT_name("LOG_Event")
	.dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$111)
	.dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
$C$DW$T$114	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$113)
	.dwattr $C$DW$T$114, DW_AT_address_class(0x20)

$C$DW$T$115	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$115, DW_AT_name("LOG_Obj")
	.dwattr $C$DW$T$115, DW_AT_byte_size(0x18)
$C$DW$473	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$112)
	.dwattr $C$DW$473, DW_AT_name("bufend")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("_bufend")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$474	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$474, DW_AT_name("flag")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("_flag")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$475	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$475, DW_AT_name("seqnum")
	.dwattr $C$DW$475, DW_AT_TI_symbol_name("_seqnum")
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$476	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$114)
	.dwattr $C$DW$476, DW_AT_name("curptr")
	.dwattr $C$DW$476, DW_AT_TI_symbol_name("_curptr")
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$477	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$477, DW_AT_name("lenmask")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("_lenmask")
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$478	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$114)
	.dwattr $C$DW$478, DW_AT_name("bufbeg")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("_bufbeg")
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$115

$C$DW$T$407	.dwtag  DW_TAG_typedef, DW_AT_name("LOG_Obj")
	.dwattr $C$DW$T$407, DW_AT_type(*$C$DW$T$115)
	.dwattr $C$DW$T$407, DW_AT_language(DW_LANG_C)
$C$DW$T$408	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$115)
	.dwattr $C$DW$T$408, DW_AT_address_class(0x20)
$C$DW$T$409	.dwtag  DW_TAG_typedef, DW_AT_name("LOG_Handle")
	.dwattr $C$DW$T$409, DW_AT_type(*$C$DW$T$408)
	.dwattr $C$DW$T$409, DW_AT_language(DW_LANG_C)

$C$DW$T$116	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$116, DW_AT_name("FXN_Obj")
	.dwattr $C$DW$T$116, DW_AT_byte_size(0x0c)
$C$DW$479	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$479, DW_AT_name("fxn")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("_fxn")
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$480	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$480, DW_AT_name("arg1")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("_arg1")
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$481	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$481, DW_AT_name("arg0")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("_arg0")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$116

$C$DW$T$122	.dwtag  DW_TAG_typedef, DW_AT_name("FXN_Obj")
	.dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
$C$DW$T$410	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$T$410, DW_AT_address_class(0x20)
$C$DW$T$411	.dwtag  DW_TAG_typedef, DW_AT_name("FXN_Handle")
	.dwattr $C$DW$T$411, DW_AT_type(*$C$DW$T$410)
	.dwattr $C$DW$T$411, DW_AT_language(DW_LANG_C)

$C$DW$T$118	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$118, DW_AT_name("STS_Obj")
	.dwattr $C$DW$T$118, DW_AT_byte_size(0x0c)
$C$DW$482	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$117)
	.dwattr $C$DW$482, DW_AT_name("num")
	.dwattr $C$DW$482, DW_AT_TI_symbol_name("_num")
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$483	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$117)
	.dwattr $C$DW$483, DW_AT_name("acc")
	.dwattr $C$DW$483, DW_AT_TI_symbol_name("_acc")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$484	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$117)
	.dwattr $C$DW$484, DW_AT_name("max")
	.dwattr $C$DW$484, DW_AT_TI_symbol_name("_max")
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$118

$C$DW$T$123	.dwtag  DW_TAG_typedef, DW_AT_name("STS_Obj")
	.dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$118)
	.dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
$C$DW$T$124	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$123)
	.dwattr $C$DW$T$124, DW_AT_address_class(0x20)
$C$DW$T$412	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$118)
	.dwattr $C$DW$T$412, DW_AT_address_class(0x20)
$C$DW$T$413	.dwtag  DW_TAG_typedef, DW_AT_name("STS_Handle")
	.dwattr $C$DW$T$413, DW_AT_type(*$C$DW$T$412)
	.dwattr $C$DW$T$413, DW_AT_language(DW_LANG_C)

$C$DW$T$119	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$119, DW_AT_name("HWI_DataObj")
	.dwattr $C$DW$T$119, DW_AT_byte_size(0x10)
$C$DW$485	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$485, DW_AT_name("spsave")
	.dwattr $C$DW$485, DW_AT_TI_symbol_name("_spsave")
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$486	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$486, DW_AT_name("stkBottom")
	.dwattr $C$DW$486, DW_AT_TI_symbol_name("_stkBottom")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$487	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$487, DW_AT_name("stkTop")
	.dwattr $C$DW$487, DW_AT_TI_symbol_name("_stkTop")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$488	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$488, DW_AT_name("inhwi")
	.dwattr $C$DW$488, DW_AT_TI_symbol_name("_inhwi")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$119

$C$DW$T$414	.dwtag  DW_TAG_typedef, DW_AT_name("HWI_DataObj")
	.dwattr $C$DW$T$414, DW_AT_type(*$C$DW$T$119)
	.dwattr $C$DW$T$414, DW_AT_language(DW_LANG_C)

$C$DW$T$120	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$120, DW_AT_name("HWI_Attrs")
	.dwattr $C$DW$T$120, DW_AT_byte_size(0x0c)
$C$DW$489	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$489, DW_AT_name("intrMask")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("_intrMask")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$490	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$490, DW_AT_name("ccMask")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("_ccMask")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$491	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$491, DW_AT_name("arg")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("_arg")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$120

$C$DW$T$415	.dwtag  DW_TAG_typedef, DW_AT_name("HWI_Attrs")
	.dwattr $C$DW$T$415, DW_AT_type(*$C$DW$T$120)
	.dwattr $C$DW$T$415, DW_AT_language(DW_LANG_C)

$C$DW$T$121	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$121, DW_AT_name("SWI_DataObj")
	.dwattr $C$DW$T$121, DW_AT_byte_size(0x24)
$C$DW$492	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$492, DW_AT_name("runfxn")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("_runfxn")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$493	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$493, DW_AT_name("execfxn")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("_execfxn")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$494	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$494, DW_AT_name("curmask")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("_curmask")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$495	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$495, DW_AT_name("curset")
	.dwattr $C$DW$495, DW_AT_TI_symbol_name("_curset")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$496	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$496, DW_AT_name("lock")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("_lock")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$497	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$497, DW_AT_name("curmbox")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("_curmbox")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$498	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$498, DW_AT_name("curfxn")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("_curfxn")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$499	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$499, DW_AT_name("rdybeg")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("_rdybeg")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$500	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$500, DW_AT_name("inswi")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("_inswi")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$121

$C$DW$T$416	.dwtag  DW_TAG_typedef, DW_AT_name("SWI_DataObj")
	.dwattr $C$DW$T$416, DW_AT_type(*$C$DW$T$121)
	.dwattr $C$DW$T$416, DW_AT_language(DW_LANG_C)

$C$DW$T$125	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$125, DW_AT_name("SWI_Obj")
	.dwattr $C$DW$T$125, DW_AT_byte_size(0x2c)
$C$DW$501	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$501, DW_AT_name("lock")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("_lock")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$502	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$502, DW_AT_name("ready")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("_ready")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$503	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$503, DW_AT_name("mask")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("_mask")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$504	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$504, DW_AT_name("link")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("_link")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$505	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$505, DW_AT_name("initkey")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("_initkey")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$506	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$506, DW_AT_name("mailbox")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("_mailbox")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$507	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$122)
	.dwattr $C$DW$507, DW_AT_name("fxnobj")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("_fxnobj")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$508	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$508, DW_AT_name("stslock")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("_stslock")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$509	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$124)
	.dwattr $C$DW$509, DW_AT_name("sts")
	.dwattr $C$DW$509, DW_AT_TI_symbol_name("_sts")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$125

$C$DW$T$417	.dwtag  DW_TAG_typedef, DW_AT_name("SWI_Obj")
	.dwattr $C$DW$T$417, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$T$417, DW_AT_language(DW_LANG_C)
$C$DW$T$418	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$T$418, DW_AT_address_class(0x20)
$C$DW$T$419	.dwtag  DW_TAG_typedef, DW_AT_name("SWI_Handle")
	.dwattr $C$DW$T$419, DW_AT_type(*$C$DW$T$418)
	.dwattr $C$DW$T$419, DW_AT_language(DW_LANG_C)

$C$DW$T$129	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$129, DW_AT_name("SWI_Attrs")
	.dwattr $C$DW$T$129, DW_AT_byte_size(0x14)
$C$DW$510	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$510, DW_AT_name("fxn")
	.dwattr $C$DW$510, DW_AT_TI_symbol_name("_fxn")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$511	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$511, DW_AT_name("arg0")
	.dwattr $C$DW$511, DW_AT_TI_symbol_name("_arg0")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$512	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$512, DW_AT_name("arg1")
	.dwattr $C$DW$512, DW_AT_TI_symbol_name("_arg1")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$513	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$513, DW_AT_name("priority")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("_priority")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$514	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$514, DW_AT_name("mailbox")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("_mailbox")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$129

$C$DW$T$420	.dwtag  DW_TAG_typedef, DW_AT_name("SWI_Attrs")
	.dwattr $C$DW$T$420, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$T$420, DW_AT_language(DW_LANG_C)

$C$DW$T$130	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$130, DW_AT_name("SYS_Config")
	.dwattr $C$DW$T$130, DW_AT_byte_size(0x10)
$C$DW$515	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$515, DW_AT_name("ABORTFXN")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("_ABORTFXN")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$516	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$516, DW_AT_name("ERRORFXN")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("_ERRORFXN")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$517	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$517, DW_AT_name("EXITFXN")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("_EXITFXN")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$518	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$518, DW_AT_name("PUTCFXN")
	.dwattr $C$DW$518, DW_AT_TI_symbol_name("_PUTCFXN")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$130

$C$DW$T$421	.dwtag  DW_TAG_typedef, DW_AT_name("SYS_Config")
	.dwattr $C$DW$T$421, DW_AT_type(*$C$DW$T$130)
	.dwattr $C$DW$T$421, DW_AT_language(DW_LANG_C)

$C$DW$T$131	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$131, DW_AT_name("MEM_Attrs")
	.dwattr $C$DW$T$131, DW_AT_byte_size(0x04)
$C$DW$519	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$519, DW_AT_name("space")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("_space")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$131

$C$DW$T$422	.dwtag  DW_TAG_typedef, DW_AT_name("MEM_Attrs")
	.dwattr $C$DW$T$422, DW_AT_type(*$C$DW$T$131)
	.dwattr $C$DW$T$422, DW_AT_language(DW_LANG_C)

$C$DW$T$132	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$132, DW_AT_name("MEM_Config")
	.dwattr $C$DW$T$132, DW_AT_byte_size(0x04)
$C$DW$520	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$520, DW_AT_name("MALLOCSEG")
	.dwattr $C$DW$520, DW_AT_TI_symbol_name("_MALLOCSEG")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$132

$C$DW$T$423	.dwtag  DW_TAG_typedef, DW_AT_name("MEM_Config")
	.dwattr $C$DW$T$423, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$T$423, DW_AT_language(DW_LANG_C)

$C$DW$T$134	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$134, DW_AT_name("MEM_Segment")
	.dwattr $C$DW$T$134, DW_AT_byte_size(0x0c)
$C$DW$521	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$521, DW_AT_name("base")
	.dwattr $C$DW$521, DW_AT_TI_symbol_name("_base")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$522	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$522, DW_AT_name("length")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("_length")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$523	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$523, DW_AT_name("space")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("_space")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$134

$C$DW$T$424	.dwtag  DW_TAG_typedef, DW_AT_name("MEM_Segment")
	.dwattr $C$DW$T$424, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$T$424, DW_AT_language(DW_LANG_C)

$C$DW$T$135	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$135, DW_AT_name("MEM_Stat")
	.dwattr $C$DW$T$135, DW_AT_byte_size(0x10)
$C$DW$524	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$524, DW_AT_name("size")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("_size")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$525	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$525, DW_AT_name("used")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("_used")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$526	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$526, DW_AT_name("length")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("_length")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$527	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$527, DW_AT_name("space")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("_space")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$135

$C$DW$T$425	.dwtag  DW_TAG_typedef, DW_AT_name("MEM_Stat")
	.dwattr $C$DW$T$425, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$T$425, DW_AT_language(DW_LANG_C)

$C$DW$T$137	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$137, DW_AT_name("MEM_Header")
	.dwattr $C$DW$T$137, DW_AT_byte_size(0x08)
$C$DW$528	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$528, DW_AT_name("next")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("_next")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$529	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$529, DW_AT_name("size")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("_size")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$137

$C$DW$T$136	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$T$136, DW_AT_address_class(0x20)
$C$DW$T$426	.dwtag  DW_TAG_typedef, DW_AT_name("MEM_Header")
	.dwattr $C$DW$T$426, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$T$426, DW_AT_language(DW_LANG_C)

$C$DW$T$138	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$138, DW_AT_name("QUE_Attrs")
	.dwattr $C$DW$T$138, DW_AT_byte_size(0x04)
$C$DW$530	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$530, DW_AT_name("dummy")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("_dummy")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$138

$C$DW$T$427	.dwtag  DW_TAG_typedef, DW_AT_name("QUE_Attrs")
	.dwattr $C$DW$T$427, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$T$427, DW_AT_language(DW_LANG_C)

$C$DW$T$140	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$140, DW_AT_name("KNL_Obj")
	.dwattr $C$DW$T$140, DW_AT_byte_size(0x38)
$C$DW$531	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$531, DW_AT_name("ready")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("_ready")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$532	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$532, DW_AT_name("alarm")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("_alarm")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$533	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$533, DW_AT_name("setpri")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("_setpri")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$534	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$534, DW_AT_name("queue")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("_queue")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$535	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$139)
	.dwattr $C$DW$535, DW_AT_name("priority")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("_priority")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$536	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$536, DW_AT_name("mask")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("_mask")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$537	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$537, DW_AT_name("sp")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("_sp")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$538	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$538, DW_AT_name("timeout")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("_timeout")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$539	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$539, DW_AT_name("mode")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("_mode")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$540	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$124)
	.dwattr $C$DW$540, DW_AT_name("sts")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("_sts")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$541	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$541, DW_AT_name("signalled")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("_signalled")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$140

$C$DW$T$149	.dwtag  DW_TAG_typedef, DW_AT_name("KNL_Obj")
	.dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$140)
	.dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
$C$DW$T$428	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$140)
	.dwattr $C$DW$T$428, DW_AT_address_class(0x20)
$C$DW$T$429	.dwtag  DW_TAG_typedef, DW_AT_name("KNL_Handle")
	.dwattr $C$DW$T$429, DW_AT_type(*$C$DW$T$428)
	.dwattr $C$DW$T$429, DW_AT_language(DW_LANG_C)

$C$DW$T$141	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$141, DW_AT_name("KNL_AObj")
	.dwattr $C$DW$T$141, DW_AT_byte_size(0x30)
$C$DW$542	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$542, DW_AT_name("alarm")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("_alarm")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$543	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$543, DW_AT_name("setpri")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("_setpri")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$544	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$544, DW_AT_name("queue")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("_queue")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$545	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$139)
	.dwattr $C$DW$545, DW_AT_name("priority")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("_priority")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$546	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$546, DW_AT_name("mask")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("_mask")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$547	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$547, DW_AT_name("sp")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("_sp")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$548	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$548, DW_AT_name("timeout")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("_timeout")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$549	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$549, DW_AT_name("mode")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("_mode")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$550	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$124)
	.dwattr $C$DW$550, DW_AT_name("sts")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("_sts")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$551	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$551, DW_AT_name("signalled")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("_signalled")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$141

$C$DW$T$430	.dwtag  DW_TAG_typedef, DW_AT_name("KNL_AObj")
	.dwattr $C$DW$T$430, DW_AT_type(*$C$DW$T$141)
	.dwattr $C$DW$T$430, DW_AT_language(DW_LANG_C)

$C$DW$T$142	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$142, DW_AT_name("OBJ_Header")
	.dwattr $C$DW$T$142, DW_AT_byte_size(0x0c)
$C$DW$552	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$552, DW_AT_name("link")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("_link")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$553	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$553, DW_AT_name("type")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("_type")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$142

$C$DW$T$431	.dwtag  DW_TAG_typedef, DW_AT_name("OBJ_Header")
	.dwattr $C$DW$T$431, DW_AT_type(*$C$DW$T$142)
	.dwattr $C$DW$T$431, DW_AT_language(DW_LANG_C)

$C$DW$T$143	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$143, DW_AT_name("SEM_Attrs")
	.dwattr $C$DW$T$143, DW_AT_byte_size(0x08)
$C$DW$554	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$554, DW_AT_name("type")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("_type")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$555	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$555, DW_AT_name("name")
	.dwattr $C$DW$555, DW_AT_TI_symbol_name("_name")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$143

$C$DW$T$432	.dwtag  DW_TAG_typedef, DW_AT_name("SEM_Attrs")
	.dwattr $C$DW$T$432, DW_AT_type(*$C$DW$T$143)
	.dwattr $C$DW$T$432, DW_AT_language(DW_LANG_C)

$C$DW$T$144	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$144, DW_AT_name("DEV_Device")
	.dwattr $C$DW$T$144, DW_AT_byte_size(0x18)
$C$DW$556	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$556, DW_AT_name("name")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("_name")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$557	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$557, DW_AT_name("fxns")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("_fxns")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$558	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$558, DW_AT_name("devid")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("_devid")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$559	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$559, DW_AT_name("params")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("_params")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$560	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$560, DW_AT_name("type")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("_type")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$561	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$561, DW_AT_name("devp")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("_devp")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$144

$C$DW$T$433	.dwtag  DW_TAG_typedef, DW_AT_name("DEV_Device")
	.dwattr $C$DW$T$433, DW_AT_type(*$C$DW$T$144)
	.dwattr $C$DW$T$433, DW_AT_language(DW_LANG_C)

$C$DW$T$145	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$145, DW_AT_name("DEV_Attrs")
	.dwattr $C$DW$T$145, DW_AT_byte_size(0x10)
$C$DW$562	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$562, DW_AT_name("devid")
	.dwattr $C$DW$562, DW_AT_TI_symbol_name("_devid")
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$563	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$563, DW_AT_name("params")
	.dwattr $C$DW$563, DW_AT_TI_symbol_name("_params")
	.dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$564	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$564, DW_AT_name("type")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("_type")
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$565	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$565, DW_AT_name("devp")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("_devp")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$145

$C$DW$T$434	.dwtag  DW_TAG_typedef, DW_AT_name("DEV_Attrs")
	.dwattr $C$DW$T$434, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$T$434, DW_AT_language(DW_LANG_C)

$C$DW$T$146	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$146, DW_AT_name("PRD_Obj")
	.dwattr $C$DW$T$146, DW_AT_byte_size(0x20)
$C$DW$566	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$566, DW_AT_name("status")
	.dwattr $C$DW$566, DW_AT_TI_symbol_name("_status")
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$567	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$567, DW_AT_name("kount")
	.dwattr $C$DW$567, DW_AT_TI_symbol_name("_kount")
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$568	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$568, DW_AT_name("period")
	.dwattr $C$DW$568, DW_AT_TI_symbol_name("_period")
	.dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$569	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$569, DW_AT_name("nticks")
	.dwattr $C$DW$569, DW_AT_TI_symbol_name("_nticks")
	.dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$570	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$122)
	.dwattr $C$DW$570, DW_AT_name("fxnobj")
	.dwattr $C$DW$570, DW_AT_TI_symbol_name("_fxnobj")
	.dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$571	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$124)
	.dwattr $C$DW$571, DW_AT_name("sts")
	.dwattr $C$DW$571, DW_AT_TI_symbol_name("_sts")
	.dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$146

$C$DW$T$435	.dwtag  DW_TAG_typedef, DW_AT_name("PRD_Obj")
	.dwattr $C$DW$T$435, DW_AT_type(*$C$DW$T$146)
	.dwattr $C$DW$T$435, DW_AT_language(DW_LANG_C)
$C$DW$T$436	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$146)
	.dwattr $C$DW$T$436, DW_AT_address_class(0x20)
$C$DW$T$437	.dwtag  DW_TAG_typedef, DW_AT_name("PRD_Handle")
	.dwattr $C$DW$T$437, DW_AT_type(*$C$DW$T$436)
	.dwattr $C$DW$T$437, DW_AT_language(DW_LANG_C)

$C$DW$T$147	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$147, DW_AT_name("TSK_Config")
	.dwattr $C$DW$T$147, DW_AT_byte_size(0x20)
$C$DW$572	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$572, DW_AT_name("STACKSEG")
	.dwattr $C$DW$572, DW_AT_TI_symbol_name("_STACKSEG")
	.dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$573	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$573, DW_AT_name("PRIORITY")
	.dwattr $C$DW$573, DW_AT_TI_symbol_name("_PRIORITY")
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$574	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$574, DW_AT_name("STACKSIZE")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("_STACKSIZE")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$575	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$575, DW_AT_name("CREATEFXN")
	.dwattr $C$DW$575, DW_AT_TI_symbol_name("_CREATEFXN")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$576	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$576, DW_AT_name("DELETEFXN")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("_DELETEFXN")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$577	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$577, DW_AT_name("EXITFXN")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("_EXITFXN")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$578	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$578, DW_AT_name("SWITCHFXN")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("_SWITCHFXN")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$579	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$579, DW_AT_name("READYFXN")
	.dwattr $C$DW$579, DW_AT_TI_symbol_name("_READYFXN")
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$147

$C$DW$T$438	.dwtag  DW_TAG_typedef, DW_AT_name("TSK_Config")
	.dwattr $C$DW$T$438, DW_AT_type(*$C$DW$T$147)
	.dwattr $C$DW$T$438, DW_AT_language(DW_LANG_C)

$C$DW$T$148	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$148, DW_AT_name("TSK_Attrs")
	.dwattr $C$DW$T$148, DW_AT_byte_size(0x1c)
$C$DW$580	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$580, DW_AT_name("priority")
	.dwattr $C$DW$580, DW_AT_TI_symbol_name("_priority")
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$581	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$581, DW_AT_name("stack")
	.dwattr $C$DW$581, DW_AT_TI_symbol_name("_stack")
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$582	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$582, DW_AT_name("stacksize")
	.dwattr $C$DW$582, DW_AT_TI_symbol_name("_stacksize")
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$583	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$583, DW_AT_name("stackseg")
	.dwattr $C$DW$583, DW_AT_TI_symbol_name("_stackseg")
	.dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$584	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$584, DW_AT_name("environ")
	.dwattr $C$DW$584, DW_AT_TI_symbol_name("_environ")
	.dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$585	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$585, DW_AT_name("name")
	.dwattr $C$DW$585, DW_AT_TI_symbol_name("_name")
	.dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$586	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$586, DW_AT_name("exitflag")
	.dwattr $C$DW$586, DW_AT_TI_symbol_name("_exitflag")
	.dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$587	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$587, DW_AT_name("initstackflag")
	.dwattr $C$DW$587, DW_AT_TI_symbol_name("_initstackflag")
	.dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$148

$C$DW$T$151	.dwtag  DW_TAG_typedef, DW_AT_name("TSK_Attrs")
	.dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)

$C$DW$T$150	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$150, DW_AT_name("TSK_Obj")
	.dwattr $C$DW$T$150, DW_AT_byte_size(0x54)
$C$DW$588	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$149)
	.dwattr $C$DW$588, DW_AT_name("kobj")
	.dwattr $C$DW$588, DW_AT_TI_symbol_name("_kobj")
	.dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$589	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$589, DW_AT_name("stack")
	.dwattr $C$DW$589, DW_AT_TI_symbol_name("_stack")
	.dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$590	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$590, DW_AT_name("stacksize")
	.dwattr $C$DW$590, DW_AT_TI_symbol_name("_stacksize")
	.dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$591	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$591, DW_AT_name("stackseg")
	.dwattr $C$DW$591, DW_AT_TI_symbol_name("_stackseg")
	.dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$592	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$592, DW_AT_name("name")
	.dwattr $C$DW$592, DW_AT_TI_symbol_name("_name")
	.dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$593	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$593, DW_AT_name("environ")
	.dwattr $C$DW$593, DW_AT_TI_symbol_name("_environ")
	.dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$594	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$594, DW_AT_name("errno")
	.dwattr $C$DW$594, DW_AT_TI_symbol_name("_errno")
	.dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$595	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$595, DW_AT_name("exitflag")
	.dwattr $C$DW$595, DW_AT_TI_symbol_name("_exitflag")
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$150

$C$DW$T$439	.dwtag  DW_TAG_typedef, DW_AT_name("TSK_Obj")
	.dwattr $C$DW$T$439, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$T$439, DW_AT_language(DW_LANG_C)
$C$DW$T$440	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$T$440, DW_AT_address_class(0x20)
$C$DW$T$441	.dwtag  DW_TAG_typedef, DW_AT_name("TSK_Handle")
	.dwattr $C$DW$T$441, DW_AT_type(*$C$DW$T$440)
	.dwattr $C$DW$T$441, DW_AT_language(DW_LANG_C)

$C$DW$T$153	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$153, DW_AT_name("TSK_Stat")
	.dwattr $C$DW$T$153, DW_AT_byte_size(0x28)
$C$DW$596	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$596, DW_AT_name("attrs")
	.dwattr $C$DW$596, DW_AT_TI_symbol_name("_attrs")
	.dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$597	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$597, DW_AT_name("mode")
	.dwattr $C$DW$597, DW_AT_TI_symbol_name("_mode")
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$598	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$598, DW_AT_name("sp")
	.dwattr $C$DW$598, DW_AT_TI_symbol_name("_sp")
	.dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$599	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$599, DW_AT_name("used")
	.dwattr $C$DW$599, DW_AT_TI_symbol_name("_used")
	.dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$153

$C$DW$T$442	.dwtag  DW_TAG_typedef, DW_AT_name("TSK_Stat")
	.dwattr $C$DW$T$442, DW_AT_type(*$C$DW$T$153)
	.dwattr $C$DW$T$442, DW_AT_language(DW_LANG_C)

$C$DW$T$158	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$158, DW_AT_name("MSGQ_Obj")
	.dwattr $C$DW$T$158, DW_AT_byte_size(0x1c)
$C$DW$600	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$600, DW_AT_name("name")
	.dwattr $C$DW$600, DW_AT_TI_symbol_name("_name")
	.dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$601	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$601, DW_AT_name("queue")
	.dwattr $C$DW$601, DW_AT_TI_symbol_name("_queue")
	.dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$602	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$602, DW_AT_name("notifyHandle")
	.dwattr $C$DW$602, DW_AT_TI_symbol_name("_notifyHandle")
	.dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$603	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$603, DW_AT_name("pend")
	.dwattr $C$DW$603, DW_AT_TI_symbol_name("_pend")
	.dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$604	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$604, DW_AT_name("post")
	.dwattr $C$DW$604, DW_AT_TI_symbol_name("_post")
	.dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$605	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$605, DW_AT_name("status")
	.dwattr $C$DW$605, DW_AT_TI_symbol_name("_status")
	.dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$158

$C$DW$T$192	.dwtag  DW_TAG_typedef, DW_AT_name("MSGQ_Obj")
	.dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
$C$DW$T$193	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$192)
	.dwattr $C$DW$T$193, DW_AT_address_class(0x20)
$C$DW$T$443	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$T$443, DW_AT_address_class(0x20)
$C$DW$T$444	.dwtag  DW_TAG_typedef, DW_AT_name("MSGQ_Handle")
	.dwattr $C$DW$T$444, DW_AT_type(*$C$DW$T$443)
	.dwattr $C$DW$T$444, DW_AT_language(DW_LANG_C)

$C$DW$T$159	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$159, DW_AT_name("MSGQ_Attrs")
	.dwattr $C$DW$T$159, DW_AT_byte_size(0x0c)
$C$DW$606	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$606, DW_AT_name("notifyHandle")
	.dwattr $C$DW$606, DW_AT_TI_symbol_name("_notifyHandle")
	.dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$607	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$607, DW_AT_name("pend")
	.dwattr $C$DW$607, DW_AT_TI_symbol_name("_pend")
	.dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$608	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$608, DW_AT_name("post")
	.dwattr $C$DW$608, DW_AT_TI_symbol_name("_post")
	.dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$159

$C$DW$T$445	.dwtag  DW_TAG_typedef, DW_AT_name("MSGQ_Attrs")
	.dwattr $C$DW$T$445, DW_AT_type(*$C$DW$T$159)
	.dwattr $C$DW$T$445, DW_AT_language(DW_LANG_C)

$C$DW$T$160	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$160, DW_AT_name("MSGQ_LocateAttrs")
	.dwattr $C$DW$T$160, DW_AT_byte_size(0x04)
$C$DW$609	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$609, DW_AT_name("timeout")
	.dwattr $C$DW$609, DW_AT_TI_symbol_name("_timeout")
	.dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$160

$C$DW$T$446	.dwtag  DW_TAG_typedef, DW_AT_name("MSGQ_LocateAttrs")
	.dwattr $C$DW$T$446, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$T$446, DW_AT_language(DW_LANG_C)

$C$DW$T$161	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$161, DW_AT_name("MSGQ_LocateAsyncAttrs")
	.dwattr $C$DW$T$161, DW_AT_byte_size(0x08)
$C$DW$610	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$610, DW_AT_name("poolId")
	.dwattr $C$DW$610, DW_AT_TI_symbol_name("_poolId")
	.dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$611	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$611, DW_AT_name("arg")
	.dwattr $C$DW$611, DW_AT_TI_symbol_name("_arg")
	.dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$161

$C$DW$T$447	.dwtag  DW_TAG_typedef, DW_AT_name("MSGQ_LocateAsyncAttrs")
	.dwattr $C$DW$T$447, DW_AT_type(*$C$DW$T$161)
	.dwattr $C$DW$T$447, DW_AT_language(DW_LANG_C)

$C$DW$T$163	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$163, DW_AT_name("MSGQ_MsgHeader")
	.dwattr $C$DW$T$163, DW_AT_byte_size(0x14)
$C$DW$612	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$612, DW_AT_name("reserved")
	.dwattr $C$DW$612, DW_AT_TI_symbol_name("_reserved")
	.dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$613	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$613, DW_AT_name("srcProcId")
	.dwattr $C$DW$613, DW_AT_TI_symbol_name("_srcProcId")
	.dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$614	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$614, DW_AT_name("poolId")
	.dwattr $C$DW$614, DW_AT_TI_symbol_name("_poolId")
	.dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$615	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$615, DW_AT_name("size")
	.dwattr $C$DW$615, DW_AT_TI_symbol_name("_size")
	.dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$616	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$616, DW_AT_name("dstId")
	.dwattr $C$DW$616, DW_AT_TI_symbol_name("_dstId")
	.dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$617	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$617, DW_AT_name("srcId")
	.dwattr $C$DW$617, DW_AT_TI_symbol_name("_srcId")
	.dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$618	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$618, DW_AT_name("msgId")
	.dwattr $C$DW$618, DW_AT_TI_symbol_name("_msgId")
	.dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$163

$C$DW$T$164	.dwtag  DW_TAG_typedef, DW_AT_name("MSGQ_MsgHeader")
	.dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
$C$DW$T$182	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$T$182, DW_AT_address_class(0x20)
$C$DW$T$183	.dwtag  DW_TAG_typedef, DW_AT_name("MSGQ_Msg")
	.dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$182)
	.dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)

$C$DW$T$166	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$166, DW_AT_name("MSGQ_AsyncLocateMsg")
	.dwattr $C$DW$T$166, DW_AT_byte_size(0x1c)
$C$DW$619	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$164)
	.dwattr $C$DW$619, DW_AT_name("header")
	.dwattr $C$DW$619, DW_AT_TI_symbol_name("_header")
	.dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$620	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$165)
	.dwattr $C$DW$620, DW_AT_name("msgqQueue")
	.dwattr $C$DW$620, DW_AT_TI_symbol_name("_msgqQueue")
	.dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$621	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$621, DW_AT_name("arg")
	.dwattr $C$DW$621, DW_AT_TI_symbol_name("_arg")
	.dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$166

$C$DW$T$448	.dwtag  DW_TAG_typedef, DW_AT_name("MSGQ_AsyncLocateMsg")
	.dwattr $C$DW$T$448, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$T$448, DW_AT_language(DW_LANG_C)

$C$DW$T$168	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$168, DW_AT_name("MSGQ_AsyncErrorMsg")
	.dwattr $C$DW$T$168, DW_AT_byte_size(0x1c)
$C$DW$622	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$164)
	.dwattr $C$DW$622, DW_AT_name("header")
	.dwattr $C$DW$622, DW_AT_TI_symbol_name("_header")
	.dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$623	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$167)
	.dwattr $C$DW$623, DW_AT_name("errorType")
	.dwattr $C$DW$623, DW_AT_TI_symbol_name("_errorType")
	.dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$624	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$624, DW_AT_name("mqtId")
	.dwattr $C$DW$624, DW_AT_TI_symbol_name("_mqtId")
	.dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$625	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$625, DW_AT_name("parameter")
	.dwattr $C$DW$625, DW_AT_TI_symbol_name("_parameter")
	.dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$168

$C$DW$T$449	.dwtag  DW_TAG_typedef, DW_AT_name("MSGQ_AsyncErrorMsg")
	.dwattr $C$DW$T$449, DW_AT_type(*$C$DW$T$168)
	.dwattr $C$DW$T$449, DW_AT_language(DW_LANG_C)

$C$DW$T$187	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$187, DW_AT_name("MSGQ_TransportFxns")
	.dwattr $C$DW$T$187, DW_AT_byte_size(0x14)
$C$DW$626	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$173)
	.dwattr $C$DW$626, DW_AT_name("open")
	.dwattr $C$DW$626, DW_AT_TI_symbol_name("_open")
	.dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$627	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$174)
	.dwattr $C$DW$627, DW_AT_name("close")
	.dwattr $C$DW$627, DW_AT_TI_symbol_name("_close")
	.dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$628	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$628, DW_AT_name("locate")
	.dwattr $C$DW$628, DW_AT_TI_symbol_name("_locate")
	.dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$629	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$181)
	.dwattr $C$DW$629, DW_AT_name("release")
	.dwattr $C$DW$629, DW_AT_TI_symbol_name("_release")
	.dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$630	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$186)
	.dwattr $C$DW$630, DW_AT_name("put")
	.dwattr $C$DW$630, DW_AT_TI_symbol_name("_put")
	.dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$187

$C$DW$T$189	.dwtag  DW_TAG_typedef, DW_AT_name("MSGQ_TransportFxns")
	.dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$187)
	.dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
$C$DW$T$190	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$189)
	.dwattr $C$DW$T$190, DW_AT_address_class(0x20)

$C$DW$T$191	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$191, DW_AT_name("MSGQ_TransportObj")
	.dwattr $C$DW$T$191, DW_AT_byte_size(0x14)
$C$DW$631	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$188)
	.dwattr $C$DW$631, DW_AT_name("initFxn")
	.dwattr $C$DW$631, DW_AT_TI_symbol_name("_initFxn")
	.dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$632	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$190)
	.dwattr $C$DW$632, DW_AT_name("fxns")
	.dwattr $C$DW$632, DW_AT_TI_symbol_name("_fxns")
	.dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$633	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$633, DW_AT_name("params")
	.dwattr $C$DW$633, DW_AT_TI_symbol_name("_params")
	.dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$634	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$634, DW_AT_name("object")
	.dwattr $C$DW$634, DW_AT_TI_symbol_name("_object")
	.dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$635	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$635, DW_AT_name("procId")
	.dwattr $C$DW$635, DW_AT_TI_symbol_name("_procId")
	.dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$191

$C$DW$T$169	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$191)
	.dwattr $C$DW$T$169, DW_AT_address_class(0x20)
$C$DW$T$170	.dwtag  DW_TAG_typedef, DW_AT_name("MSGQ_TransportHandle")
	.dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$169)
	.dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
$C$DW$T$194	.dwtag  DW_TAG_typedef, DW_AT_name("MSGQ_TransportObj")
	.dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$191)
	.dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
$C$DW$T$195	.dwtag  DW_TAG_pointer_type, DW_AT_type(*$C$DW$T$194)
	.dwattr $C$DW$T$195, DW_AT_address_class(0x20)

$C$DW$T$196	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$196, DW_AT_name("MSGQ_Config")
	.dwattr $C$DW$T$196, DW_AT_byte_size(0x18)
$C$DW$636	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$193)
	.dwattr $C$DW$636, DW_AT_name("msgqQueues")
	.dwattr $C$DW$636, DW_AT_TI_symbol_name("_msgqQueues")
	.dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$637	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$195)
	.dwattr $C$DW$637, DW_AT_name("transports")
	.dwattr $C$DW$637, DW_AT_TI_symbol_name("_transports")
	.dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$638	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$638, DW_AT_name("numMsgqQueues")
	.dwattr $C$DW$638, DW_AT_TI_symbol_name("_numMsgqQueues")
	.dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$639	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$639, DW_AT_name("numProcessors")
	.dwattr $C$DW$639, DW_AT_TI_symbol_name("_numProcessors")
	.dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$640	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$640, DW_AT_name("startUninitialized")
	.dwattr $C$DW$640, DW_AT_TI_symbol_name("_startUninitialized")
	.dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$641	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$165)
	.dwattr $C$DW$641, DW_AT_name("errorQueue")
	.dwattr $C$DW$641, DW_AT_TI_symbol_name("_errorQueue")
	.dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$642	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$642, DW_AT_name("errorPoolId")
	.dwattr $C$DW$642, DW_AT_TI_symbol_name("_errorPoolId")
	.dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$196

$C$DW$T$450	.dwtag  DW_TAG_typedef, DW_AT_name("MSGQ_Config")
	.dwattr $C$DW$T$450, DW_AT_type(*$C$DW$T$196)
	.dwattr $C$DW$T$450, DW_AT_language(DW_LANG_C)

$C$DW$T$198	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$198, DW_AT_name("CHNL_Irp_tag")
	.dwattr $C$DW$T$198, DW_AT_byte_size(0x1c)
$C$DW$643	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$643, DW_AT_name("link")
	.dwattr $C$DW$643, DW_AT_TI_symbol_name("_link")
	.dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$644	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$644, DW_AT_name("buffer")
	.dwattr $C$DW$644, DW_AT_TI_symbol_name("_buffer")
	.dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$645	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$197)
	.dwattr $C$DW$645, DW_AT_name("arg")
	.dwattr $C$DW$645, DW_AT_TI_symbol_name("_arg")
	.dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$646	.dwtag  DW_TAG_member, DW_AT_type(*$C$DW$T$197)
